//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 2 ***                      //
//                                                                            //
// Файл Shape.cpp                                                             //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#include "Shape.h"


TShape::TShape()
{
  Center = TPoint();
  Rect = TRect();
}


TShape::~TShape()
{
  Center = TPoint();
  Rect = TRect();
}
