//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 2 ***                      //
//                                                                            //
// Файл Square.h                                                              //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#ifndef SQUARE_H
#define SQUARE_H

#include "Rectangle.h"


//Квадрат на плоскости
class TSquare : public TRectangle
{
  public:
    //На вход подаются:
    //  - координаты центра квадрата;
    //  - размер квадрата
    TSquare(TPoint P, double Size);

    TSquare(void) = delete;
    ~TSquare(void);
};


#endif
